In [1]:

# importing pandas library
import pandas as pd
 
# Create empty dataframe
df = pd.DataFrame()
 
# Creating a simple dataframe
df['name'] = ['Reema', 'Shyam', 'Jai',
              'Nimisha', 'Rohit', 'Riya']
df['gender'] = ['Female', 'Male', 'Male',
                'Female', 'Male', 'Female']
df['age'] = [31, 32, 19, 23, 28, 33]
 
# View dataframe
df

      name  gender  age
0    Reema  Female   31
1    Shyam    Male   32
2      Jai    Male   19
3  Nimisha  Female   23
4    Rohit    Male   28
5     Riya  Female   33

In [37]:
#Processes of the pipelining

def mean_age_by_group(dataframe, col):
   
    return dataframe.groupby(col).mean()
   

def uppercase_column_name(dataframe):
   
    dataframe.columns = dataframe.columns.str.upper()
    return dataframe 

def drop_above_30(dataframe):
    return dataframe[dataframe['age'] <= 30]

In [38]:
pipeline = df.pipe(mean_age_by_group, col='gender').pipe(uppercase_column_name)
pipeline

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_21548\782792248.py:5: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  return dataframe.groupby(col).mean()

              AGE
gender
Female  29.000000
Male    26.333333

In [44]:
pipeline_2 = df.pipe(drop_above_30)
pipeline_2

      name  gender  age
2      Jai    Male   19
3  Nimisha  Female   23
4    Rohit    Male   28

In [48]:
pipeline.head()

              AGE
gender
Female  29.000000
Male    26.333333

In [49]:
pipeline_2.head()

      name  gender  age
2      Jai    Male   19
3  Nimisha  Female   23
4    Rohit    Male   28